package cn.ximcloud.itsource.day15._00review;

import javax.swing.*;

/**
 * Created by IntelliJ IDEA.
 * User: wzard
 * Date: 2018-06-28
 * Time: 10:12
 * ProjectName: ITSource
 * To change this template use File | Settings | Editor | File and Code Templates.
 * ////////////////////////////////////////////////////////////////////
 * //                          _ooOoo_                               //
 * //                         o8888888o                              //
 * //                         88" . "88                              //
 * //                         (| ^_^ |)                              //
 * //                         O\  =  /O                              //
 * //                      ____/`---'\____                           //
 * //                    .'  \\|     |//  `.                         //
 * //                   /  \\|||  :  |||//  \                        //
 * //                  /  _||||| -:- |||||-  \                       //
 * //                  |   | \\\  -  /// |   |                       //
 * //                  | \_|  ''\---/''  |   |                       //
 * //                  \  .-\__  `-`  ___/-. /                       //
 * //                ___`. .'  /--.--\  `. . ___                     //
 * //              ."" '<  `.___\_<|>_/___.'  >'"".                  //
 * //            | | :  `- \`.;`\ _ /`;.`/ - ` : | |                 //
 * //            \  \ `-.   \_ __\ /__ _/   .-` /  /                 //
 * //      ========`-.____`-.___\_____/___.-`____.-'========         //
 * //                           `=---='                              //
 * //      ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^        //
 * //         佛祖保佑        永无BUG      永不修改                  //
 * ////////////////////////////////////////////////////////////////////
 **/

public class _00review {
    /*
        1. 常用组件
        2. 布局模式
        3. 事件监听机制
        4. 常用组件学习的意义及如何查找
            1) 意义:从代码，图形化的界面，看到夏鸥哦
                通过使用建立面向对象常识
            2) 对于图形化编程，也就是桌面应用长须，都是由对象。
                需要知道什么名字才能够快速的完成编程
        5. 常用布局
            1) 流式布局，边框布局，网格布局
     */
    public static void main(String[] args) {
        //①编写任何的GUI程序都有一个窗体
        JFrame jFrame = new JFrame(); //默认顶层窗体，默认隐藏

        //②布局，边框布局，borderLayout

        /*
            南 -- button
            东 -- button
            中 -- panel: 最简单得容器
                         可以设置布局模式GirdLayout

         */

    }
}
